
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СостояниеЗаявок
	Движения.СостояниеЗаявок.Записывать = Истина;
	Движение = Движения.СостояниеЗаявок.Добавить();
	Движение.Заявка = Ссылка;
	Движение.Водитель = ВодтиельИсполнитель;
	Движение.Автомобиль = ВодтиельИсполнитель.Автомобиль;
	Движение.ВесГруза = ВесГруза;
	Движение.Расстояние = Расстояние;
	Движение.ВремяОжидания = СрокДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
