
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПогрузкаРазгрузка
	Движения.ПогрузкаРазгрузка.Записывать = Истина;
	Движение = Движения.ПогрузкаРазгрузка.Добавить();
	Движение.Груз = ТипГруза;
	Движение.Автоисполнитель = Водитель;
	Движение.Терминал = МестоСтоянки;
	Движение.ВремяРазгрузки = ВремяРазгрузки;
	Движение.ВремяПогрузки = ВремяПогрузки;
	Движение.ВесПогружаемогоГруза = ВесПогружаемогоТовара;
	Движение.Выполнено = Выполнен;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
